# Week 8 Q&A Activity

In [7]:
import pandas as pd

In [8]:
data=pd.read_csv("Advertising.csv")

### 1. Explain the dataset .

In [9]:
data.head()

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

In [10]:
data.columns

Index(['Unnamed: 0', 'TV', 'Radio', 'Newspaper', 'Sales'], dtype='object')

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  200 non-null    int64
 1   TV          200 non-null    float64
 2   Radio       200 non-null    float64
 3   Newspaper   200 non-null    float64
 4   Sales       200 non-null    float64
dtypes: float64(4), int64(1)
memory usage: 7.9 KB

In [12]:
data.shape

(200, 5)

### 2. Check the summary statistics and discuss the max, min, avg, median, and percentiles.

In [13]:
data1=data.drop('Unnamed: 0',axis=1)
data1.describe()

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

#### Maximum Value

In [15]:
data1.max()

TV           296.4
Radio         49.6
Newspaper    114.0
Sales         27.0
dtype: float64

#### Minimum Value

In [16]:
data1.min()

TV           0.7
Radio        0.0
Newspaper    0.3
Sales        1.6
dtype: float64

#### Average Value

In [18]:
data1.mean()

TV           147.0425
Radio         23.2640
Newspaper     30.5540
Sales         14.0225
dtype: float64

#### Median Value

In [19]:
data1.median()

TV           149.75
Radio         22.90
Newspaper     25.75
Sales         12.90
dtype: float64

#### Percentiles

In [20]:
data1.quantile([0.25,0.50,0.75,1.00])

           TV   Radio  Newspaper   Sales
0.25   74.375   9.975      12.75  10.375
0.50  149.750  22.900      25.75  12.900
0.75  218.825  36.525      45.10  17.400
1.00  296.400  49.600     114.00  27.000

### 3. The manager wants to find out whether the same amount was spent for the three advertisements (TV , Radio and Newspaper). Comment on your findings.

Null Hypothesis H0 : Same amount was spent for the three advertisements.

Alternate Hypothesis Ha : Atleast one mode of advertisement has a different amount.

In [15]:
import scipy.stats as stats
fvalue,pvalue = stats.f_oneway(data['TV'],data['Radio'],data['Newspaper'])
print("fvalue is : ",fvalue)
print("pvalue is : ",pvalue)

fvalue is :  358.8514595342597
pvalue is :  4.552931539744962e-103

In [16]:
alpha = 0.05
if pvalue > alpha:
    print("Accept the null hypothesis")
elif pvalue < alpha:
    print("Reject the null hypothesis")

Reject the null hypothesis

In [17]:
# conclusion

We failed to accept the Null Hypothesis that same amount is spent for the three mode of advertisments. Hence the conclusion is Not the same amount is spent for the advertisments. i.e.  Atleast one mode of advertisements has a different amount.